posts/ncmc_card.html
<!DOCTYPE html><html><head><!-- 2025-02-17 --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NCMC Chennai card, My experience</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
The National Common Mobility Card (NCMC) can be obtained for free from
major bus stands in Chennai. I got one for free, but the minimum
recharge amount for the card starts at ₹100, so I had a card with ₹100
on it. The card is issued by SBI and is a prepaid card that can only
be used for commuting, not for other but services like metro parking
can be used (I haven't tried that, so I don't know for sure). They ask
for your mobile number, and within five minutes, the card is ready to
use.
</p>

<p>
I started using it for MTC (Metropolitan Transport Corporation
Chennai) buses, and after my third ride, the balance dropped to around
₹17. At this point, I needed to recharge the card. There are two
options: online and offline.
</p>

<p>
Online options:
</p>
<ul class="org-ul">
<li>Paytm</li>
<li>Airtel Thanks App (I have tried this method: search for "NCMC",
enter your mobile number and the last 4-6 digits of your card,
select the recharge amount, and pay. They charge a platform fee of
₹1.80. Similarly, there is a fee on Paytm, and I’m not sure if the
SBI app charges a fee.)</li>
<li>SBI (I assume an option is available)</li>
</ul>

<p>
Offline option:
</p>
<ul class="org-ul">
<li>Visit a major bus stand and recharge the card there.</li>
</ul>

<p>
I attempted to recharge ₹200 for my card. I received a message saying
the transaction was successful and that the amount would be reflected
within a couple of hours. The amount was debited from my account;
however, after a few hours, I received another message stating that
the transaction had failed and my amount would be refunded.
</p>

<p>
I then visited a nearby bus stand and spoke with the NCMC stall
attendant about the issue. They refreshed the card (or did something
similar), and the ₹200 was eventually transferred. They provided me
with a new receipt showing the updated balance. Even though I
recharged online, I had to verify it with them to get the amount
credited, which is a bit inconvenient and takes away the convenience
of online recharging.
</p>

<p>
Overall, from my experience, here are the pros and cons:
</p>

<p>
Pros:
</p>
<ul class="org-ul">
<li>Cashless payment—no need to carry cash.</li>
<li>You can block the card and get a new one if you lose
it. Additionally, you can recover the amount stored on the card (at
least, that’s what I’ve heard).</li>
<li>It can be used with the metro and, soon, for purchasing electric
train tickets.</li>
</ul>

<p>
Cons:
</p>
<ul class="org-ul">
<li>You do not receive an SMS or any notification after the transaction.</li>
<li>I found the Airtel Thanks App for checking the NCMC card balance to
be inaccurate, so there is no reliable way to check the balance
online at the time of my writing. You either have to ask the bus
conductor to check it or visit a bus stand.</li>
<li>Even with online recharging, a visit to the bus stand is needed to
“refresh” the card so that the recharge amount reflects in your
balance (at the time of writing).</li>
</ul>

<p>
This feature has been introduced recently, so kindly carry some cash
with you just in case.
</p>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
